Revit 2024 API
MacroModule Class
 A container for individual macros. As it relates to the macros editor, one MacroModule represents a project that can be loaded and edited from within the editor.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class MacroModule : IEnumerable<Macro>,
	IDisposable
Visual Basic
Public Class MacroModule _
	Implements IEnumerable(Of Macro), IDisposable
Visual C++
public ref class MacroModule : IEnumerable<Macro^>,
	IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Macros.MacroModule
See Also
MacroModule Members
Autodesk.Revit.DB.Macros Namespace